In [1]:
import pandas as pd

In [4]:
data = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
data = pd.DataFrame([1,2,3,4,5])
data

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
dict = {'name':['kamal','saman','nimal'],'marks':[80,60,70]}
df = pd.DataFrame(dict)
df

    name  marks
0  kamal     80
1  saman     60
2  nimal     70

In [8]:
dict1 = {'kamal':[4,5,6,7],'saman':[7,6,5,4]}
df1 = pd.DataFrame(dict1)
dict2 = {'nimal':[1,4,6,7],'sunil':[9,6,4,2]}
df2 = pd.DataFrame(dict2)

In [9]:
df1

   kamal  saman
0      4      7
1      5      6
2      6      5
3      7      4

In [10]:
df2

   nimal  sunil
0      1      9
1      4      6
2      6      4
3      7      2

In [11]:
pd.concat([df1,df2])

   kamal  saman  nimal  sunil
0    4.0    7.0    NaN    NaN
1    5.0    6.0    NaN    NaN
2    6.0    5.0    NaN    NaN
3    7.0    4.0    NaN    NaN
0    NaN    NaN    1.0    9.0
1    NaN    NaN    4.0    6.0
2    NaN    NaN    6.0    4.0
3    NaN    NaN    7.0    2.0

In [12]:
pd.concat([df1,df2],axis=1)

   kamal  saman  nimal  sunil
0      4      7      1      9
1      5      6      4      6
2      6      5      6      4
3      7      4      7      2